Revit 2027 API
NumberSystemDisplayRule Enumeration
 The available options for display of numeric values in the number system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum NumberSystemDisplayRule
Public Enumeration NumberSystemDisplayRule
public enum class NumberSystemDisplayRule
type NumberSystemDisplayRule
Members
Member name | Value | Description
All | 0 |  The number system will display all the numbers.
Even | 2 |  The number system will only display the even numbers.
Odd | 1 |  The number system will only display the odd numbers.
StartAndEnd | 3 |  The number system will only display the start and end numbers.
See Also
Reference
Autodesk.Revit.DB Namespace